Revit 2027 API
Application.NewFamilyInstanceCreationData(XYZ, FamilySymbol, StructuralType) Method
Creates an object which wraps the arguments of NewFamilyInstance() for batch creation.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FamilyInstanceCreationData NewFamilyInstanceCreationData(
	XYZ location,
	FamilySymbol symbol,
	StructuralType structuralType
)
Public Function NewFamilyInstanceCreationData (
	location As XYZ,
	symbol As FamilySymbol,
	structuralType As StructuralType
) As FamilyInstanceCreationData
public:
FamilyInstanceCreationData^ NewFamilyInstanceCreationData(
	XYZ^ location,
	FamilySymbol^ symbol,
	StructuralType structuralType
)
member NewFamilyInstanceCreationData :
        location : XYZ *
        symbol : FamilySymbol *
        structuralType : StructuralType -> FamilyInstanceCreationData
Parameters
location XYZ
 The physical location where the instance is to be placed.
symbol FamilySymbol
 A FamilySymbol object that represents the type of the instance that is to be inserted.
structuralType StructuralType
 Specify if the family instance is structural.
Return Value
FamilyInstanceCreationData
See Also
Reference
Application Class
NewFamilyInstanceCreationData Overload
Autodesk.Revit.Creation Namespace